In [1]:
'''
seaborn의 타이타닉 데이터를 불러오자
'''
import seaborn as sns
df = sns.load_dataset('titanic')

- df.head() : 상위 행 5(지정가능)개 / df.tail()
- df.shape : shape() X
- **df.info()** : 자료형 확인, NaN값 확인, 개수 # 총 개수 확인. 결측치 → 열 자체를 제거할 것인가/ 결측치가 있는 행을 제거할 것인가
- **df.describe()** : 산술데이터(mean, sd, max, min, median)
- df.describe(include='all') : 문자열데이터(unique/고유값 개수, top/최빈값, freq/빈도수)
- df.dtypes

In [2]:
'''
테이터프레임 구조 확인
-
survived : 생존=1, 사망=0
pclass : 승객 등급, 1등급=1, ...
'''
df.head()

# categoty : 범주형
# survived / alive -> 같은 data : 두번 학습 : 과적합 / 가능하면 숫자가 좋음

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [4]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [5]:
df_s = df.loc[:,'survived'] # e - df.loc['survived']
print(type(df_s))
df_s.head()

<class 'pandas.core.series.Series'>

0    0
1    1
2    1
3    1
4    0
Name: survived, dtype: int64

In [6]:
'''
이때 info()를 통해 어느 데이터에 누락 데이터가 많은지를 확인하자.
문제가 있는지 확인을 해야한다.
그 열이 가진 고유값을 확인해 보자.
value_counts로 확인을 하자. 이때 NaN을 포함시켜야한다.
'''
df['deck'].value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

>- Case1 : 데이터의 품질을 올리기 위해 누락데이터를 삭제
>- Case2 : 데이터의 품질을 포기하고 누락 데이터를 최대한 살림. fillna() 메소드
>- Case3 : 데이터가 너무 적다. 누락 데이터를 어떻게 바꿀까? → 평균값 vs 최빈값 vs 중간값
- 직접 코드 쳐서 보고 데이터의 중요성을 확실히 판단 후 열을 제거할지 말지 결정 → 왜 삭제하는지 반드시 적은 후 삭제
- Raw data → 안 건드는게 좋음

In [7]:
# 1단계_누락 데이터 처리
# NaN(결측치) 개수 계산
'''
for 반복문으로 각 열의 NaN 개수 계산하기
'''
missing_df = df.isnull()
# missing_df.head()

for col in missing_df.columns:
    missing_count = missing_df[col].value_counts()
#     print(missing_count)
#     print()
    try:
        print(col, ':', missing_count[True])
    except:
        continue # 가장 자까운 반복문으로
        # print(col, ':', 0)
        # null값이 없으면 True가 인덱스로 나오지 않아서 missing_count[True]가 성립 X

age : 177
embarked : 2
deck : 688
embark_town : 2

In [8]:
# 2단계_누락 데이터 제거
'''
# NaN 값이 500개 이상인 열을 모두 삭제
'''
df_thresh = df.dropna(axis=1, thresh=500)
df_thresh.columns # ?? : axis=0 이었음..

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [9]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [10]:
'''
# age 열에 나이 데이터가 없는 모든 행을 삭제 
'''
print(df.shape)
df_age = df.dropna(subset=['age'], how='any', axis=0)

# check
print(df_age.shape)

(891, 15)
(714, 15)

In [11]:
# 2단계_누락 데이터 치환
'''
age 열의 첫 10개 데이터 출력 (5 행에 NaN 값)
'''
df['age'].head(10)
# ** 열이 너무 많을 때 df.head(3).T

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [12]:
# for문으로 NaN값
a = df['age'].head(10)

for idx, val in enumerate(a):
    if str(val) == 'nan':        # "NaN", "np.nan"
        print(idx, val)

5 nan

In [13]:
a.isnull()
# df.notnull()
# df.isnull().sum(axis=0) # default axis=0

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: age, dtype: bool

In [14]:
'''
age 열의 NaN값을 다른 나이 데이터의 평균으로 변경하기
+ 중간값으로 변경해보기
+ 최빈값으로 변경해보기
'''
mean_age = df['age'].mean(axis=0) # Series(열)라 축 않넣어도 # ->자동으로 결측치는 제외하고 계산해줌
# mean_age #round적용X
a.fillna(mean_age, inplace=True)
a.head(6)
a.isnull().sum() # 0 = nan 값이 없다는거

0

In [15]:
# median_age = df['age'].median(axis=0)
# a.fillna(median_age, inplace=True)
# a.head(6)

In [16]:
'''
CASE 1 
embark_town 열의 829행의 NaN 데이터 출력
'''
df['embark_town'][827:832]

827      Cherbourg
828     Queenstown
829            NaN
830      Cherbourg
831    Southampton
Name: embark_town, dtype: object

In [17]:
b = df['embark_town']

for idx, val in enumerate(b):
    if str(val) == 'nan': 
        print(idx, val)

61 nan
829 nan

In [18]:
'''
embark_town 열의 NaN값을 승선도시 중에서 가장 많이 출현한 값으로 치환하기
'''
most_freq = df['embark_town'].value_counts(dropna=False)
most_freq
most_freq = df['embark_town'].value_counts(dropna=True).idxmax()
df['embark_town'].fillna(most_freq) # , inplace=True
print(most_freq)
df['embark_town'][827:832]

Southampton

827      Cherbourg
828     Queenstown
829            NaN
830      Cherbourg
831    Southampton
Name: embark_town, dtype: object

In [19]:
# idmax, argmax, softmax ?

mosr_freq = df['embark_town'].value_counts(dropna=True).idxmax() # value가 가장 큰 값의 index를 뽑는다
mosr_freq

'Southampton'

In [20]:
'''
embark_town 열 829행의 NaN 데이터 출력 (NaN 값이 most_freq 값으로 대체)
'''
df['embark_town'][825:830]
df['embark_town'].fillna('Southampton', inplace=True)

In [21]:
'''
CASE 2
embark_town 열의 NaN값을 바로 앞에 있는 828행의 값으로 변경하기
'''
print(df['embark_town'][825:830])
print()
df['embark_town'].fillna(method='ffill', inplace=True) # ffill : front값을 기준으로 채움 / bfill : back
print(df['embark_town'][825:830])
# 시계열 아니면 크게 쓸 일 없음. (시간에 따르기 때문에) -> 일요일 데이터를 토/월꺼로 채운다던가, 비운다던가
# 주기성(계절) -> 범위함수 ~

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [22]:
'''
age 열의 첫 10개 데이터 출력 (5 행에 NaN 값이 평균으로 대체)
'''
df['age'].head(10)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

## 실습

In [24]:
# 라이브러리 불러오기
import pandas as pd

# 중복 데이터를 갖는 데이터프레임 만들기
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [25]:
'''
데이터프레임 전체 행 데이터 중에서 중복값 찾기
'''
df_d = df.duplicated()
df_d

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [26]:
'''
데이터프레임의 특정 열 데이터에서 중복값 찾기
'''
# df[['c2','c3']].duplicated()
# df.duplicated(subset=['c2','c3'])

df_c = df['c2'].duplicated()
df_c

# subset 옵션이 없다면 모든 열이 일치해야지만 아래 행이 지워지는 거죠?

# 중복데이터 확인 : duplicated()
# 중복데이터 제거 : drop_duplicates()

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

In [27]:
'''
데이터프레임에서 중복 행을 제거
'''
df_2 = df.drop_duplicates()
df_2 # index 그냥 지움 -> ex.WEB : 게시글 삭제해도 인덱스가 변하지는 않는다(딱히 사람들이 신경안쓰니까?)

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [28]:
'''
c2, c3열을 기준으로 중복 행을 제거
'''
df_3 = df.drop_duplicates(subset=['c2','c3'])
df_3

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2